In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

from IPython.core.display import display, HTML
display(HTML("<style>.container { width:95% !important; }</style>"))

# Run Shell Commands in Jupyter Notebook
Use **!** in front to run the shell commands in notebook

In [5]:
!python --version

Python 3.6.3 :: Anaconda custom (64-bit)

# List, Tuple, Set and Dict
1. List
    + General purpose
    + Most widely used data structure
    + Grow and shrink size as needed
    + Sequence type
    + Sortable
2. Tuple
    + Immutable (can't add/change)
    + Useful for fixed data
    + Faster than Lists
    + Sequence Type
3. Set
    + Store non-duplicate items
    + Very fast access vs Lists
    + Math Set operations (union, intersect)
4. Dict
    + Key/Value pair
    + Associative array

## List slicing
**list[start:end+1:step]**

In [15]:
x = [1, 2, 3, 4, 5, 6, 7]
print(x[1:4])    # items 1 to 3
print(x[1:6:2])  # items 1, 3, 5
print(x[4:])     # items 4 to end
print(x[:3])     # items 0 to 2
print(x[-1])     # last item
print(x[-3:])    # last 3 items
print(x[:-2])    # all except last 2 items

[2, 3, 4]
[2, 4, 6]
[5, 6, 7]
[1, 2, 3]
7
[5, 6, 7]
[1, 2, 3, 4, 5]

## List adding/concatenating and multiplying

In [43]:
x = [1, 2] + [3]
print(x)
x.append(4)
print(x)
x = ['a', 'b'] + ['c']
print(x)
x = 'a' + 'b'     # this is a string, not list
print(x)

[1, 2, 3]
[1, 2, 3, 4]
['a', 'b', 'c']
ab

In [19]:
x = [1, 3] * 3
print(x)
x = 'a' * 5     # again, this is a string
print(x)

[1, 3, 1, 3, 1, 3]
aaaaa

## Check existence

In [20]:
x = ['a', 'b', 'c']
'a' in x

True

In [22]:
print('a' in x)
print('a' not in x)

True
False

## Iterate through a list

In [31]:
x = [4, 7, 9]
for i, j in enumerate(x):
    print('index = ', i, ", x[", i, "] = ", j, sep="")

index = 0, x[0] = 4
index = 1, x[1] = 7
index = 2, x[2] = 9

## Length, Max, Min and Sum

In [36]:
len(x), max(x), min(x), sum(x)

(3, 9, 4, 20)

## Sort a list

In [71]:
x = [6, 9, 0]
sorted(x, reverse=True)
x = [6, 9, 0]
print(x)
x.sort()
print(x)
x.reverse()
print(x)

[6, 9, 0]
[0, 6, 9]
[9, 6, 0]

## List comprehension (very important)

In [54]:
x = [i for i in range(3)]
print(x)
x = [i for i in range(9) if (i > 1 and i < 5)]
print(x)

[0, 1, 2]
[2, 3, 4]

## List delete, append, extend and insert

In [63]:
x = [1,2,3,4,5]
del(x[1])
print(x)
x.append(8)
print(x)
x = [1,2,3,4,5]
x.append([1,2])   # embedded list
print(x)
x = [1,2,3,4,5]
x.extend([1,2])
print(x)
x = [1,2,3,4,5]
x.insert(2, 8)
print(x)

[1, 3, 4, 5]
[1, 3, 4, 5, 8]
[1, 2, 3, 4, 5, [1, 2]]
[1, 2, 3, 4, 5, 1, 2]
[1, 2, 8, 3, 4, 5]

# Set

In [79]:
A = [1,2,3]
B = ['a', 'b', 6, 1, 2]
print(set(A) & set(B))   # intersection
print(set(A) | set(B))   # union
print(set(A) ^ set(B))   # XOR
print(set(A) - set(B))   # in set A but not in set B
print(set(A) <= set(B))  # subset

{1, 2}
{1, 2, 3, 6, 'b', 'a'}
{'b', 3, 6, 'a'}
{3}
False

# Dictionary

In [82]:
x = {'eric': 90, 'josh': 100, 'jin':80}
x

{'eric': 90, 'jin': 80, 'josh': 100}

In [89]:
print(x.keys())
print(list(x.keys()))
print(x.values())
print(list(x.values()))

dict_keys(['eric', 'josh', 'jin'])
['eric', 'josh', 'jin']
dict_values([90, 100, 80])
[90, 100, 80]

In [90]:
for key in x:
    print(key, x[key])

eric 90
josh 100
jin 80

# Important built-in function
list of built-in functions in python 3.6:

<https://docs.python.org/3/library/functions.html>

# zip
**important for comparisons between two lists**

In [93]:
a = [1, 2, 3, 4, 5]
b = [2, 2, 9, 0, 9]
zip(a, b)

In [94]:
for i in zip(a, b):
    print(i)

(1, 2)
(2, 2)
(3, 9)
(4, 0)
(5, 9)

# lambda

lambda is just a shorthand to create an anonymous function. It's often used to create a one-off function (usually for scenarios when you need to pass a function as a parameter into another function). It can take a parameter, and it returns the value of an expression.

```lambda <input>: <expression>```

# map

map takes a function, and applies it to each item in an iterable (such as a list).

```map(some_function, some_iterable)
```

In [95]:
map(lambda pair: max(pair), zip(a, b))

In [96]:
for i in map(lambda pair: max(pair), zip(a, b)):
    print(i)

2
2
9
4
9

In [97]:
list(map(lambda pair: max(pair), zip(a, b)))

[2, 2, 9, 4, 9]

# Docs for libraries and function
To get the documnets for certain library or function, try

<b style="color:blue;"> help() </b>

To get the direction of certain object, try

<b style="color:blue;"> dir() </b>

**OR**, you should be at least able to "google". Typically, [stackoverflow](www.stackoverflow.com) and [Google](www.google.com) should be your best friend.

In [98]:
help(pd.DataFrame.min)

Help on function min in module pandas.core.frame:

min(self, axis=None, skipna=None, level=None, numeric_only=None, **kwargs)
    This method returns the minimum of the values in the object.
                If you want the *index* of the minimum, use ``idxmin``. This is
                the equivalent of the ``numpy.ndarray`` method ``argmin``.

    Parameters
    ----------
    axis : {index (0), columns (1)}
    skipna : boolean, default True
        Exclude NA/null values when computing the result.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a Series
    numeric_only : boolean, default None
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data. Not implemented for Series.

    Returns
    -------
    min : Series or DataFrame (if level specified)

In [99]:
dir(pd.DataFrame.min)

['__annotations__',
 '__call__',
 '__class__',
 '__closure__',
 '__code__',
 '__defaults__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__get__',
 '__getattribute__',
 '__globals__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__kwdefaults__',
 '__le__',
 '__lt__',
 '__module__',
 '__name__',
 '__ne__',
 '__new__',
 '__qualname__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__']

## Object Creation

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [12]:
s = pd.Series([1,3,5,np.nan,6,8], index=range(1, 7))
s

1    1.0
2    3.0
3    5.0
4    NaN
5    6.0
6    8.0
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [100]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [102]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-05  0.144436  1.283995 -0.141834 -1.229215
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [104]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [106]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [107]:
# Viewing Data

In [108]:
df.head()

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-05  0.144436  1.283995 -0.141834 -1.229215

In [109]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-05  0.144436  1.283995 -0.141834 -1.229215
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341

Display the index, columns, and the underlying numpy data

In [110]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [111]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [112]:
df.values

array([[ 0.39671681, -0.62158677,  0.01542696,  0.78238208],
       [-0.66288599,  0.57910929,  0.14089143,  1.09865905],
       [-0.71293859, -0.05471366,  0.43327536, -0.24272784],
       [ 0.03458892, -0.07212163, -1.02881031, -0.73334052],
       [ 0.14443591,  1.28399501, -0.14183405, -1.22921454],
       [ 1.58911959, -0.17882943, -0.61457599, -1.08234094]])

Describe shows a quick statistic summary of your data

In [113]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.131506  0.155975 -0.199271 -0.234430
std    0.842458  0.672991  0.534010  0.976582
min   -0.712939 -0.621587 -1.028810 -1.229215
25%   -0.488517 -0.152152 -0.496391 -0.995091
50%    0.089512 -0.063418 -0.063204 -0.488034
75%    0.333647  0.420654  0.109525  0.526105
max    1.589120  1.283995  0.433275  1.098659

Transposing your data

In [114]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.396717   -0.662886   -0.712939    0.034589    0.144436    1.589120
B   -0.621587    0.579109   -0.054714   -0.072122    1.283995   -0.178829
C    0.015427    0.140891    0.433275   -1.028810   -0.141834   -0.614576
D    0.782382    1.098659   -0.242728   -0.733341   -1.229215   -1.082341

Sorting by an axis

In [124]:
df.sort_index(axis=0, ascending=True, inplace=True)
df

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-05  0.144436  1.283995 -0.141834 -1.229215
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341

In [129]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341
2013-01-05  0.144436  1.283995 -0.141834 -1.229215
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-01  0.396717 -0.621587  0.015427  0.782382

In [130]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-05  0.144436  1.283995 -0.141834 -1.229215

In [133]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-05  0.144436  1.283995 -0.141834 -1.229215

# Selection

Selecting a single column, which yields a Series, equivalent to df.A

In [134]:
df['A']

2013-01-01    0.396717
2013-01-02   -0.662886
2013-01-03   -0.712939
2013-01-04    0.034589
2013-01-05    0.144436
2013-01-06    1.589120
Freq: D, Name: A, dtype: float64

Selecting via ```[]```, which slices the rows.

In [135]:
df[0:3]

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728

In [136]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341

## Selection by Label

See more in Selection by Label

For getting a cross section using a label

In [137]:
 df.loc[dates[0]]

A    0.396717
B   -0.621587
C    0.015427
D    0.782382
Name: 2013-01-01 00:00:00, dtype: float64

In [138]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.396717 -0.621587
2013-01-02 -0.662886  0.579109
2013-01-03 -0.712939 -0.054714
2013-01-04  0.034589 -0.072122
2013-01-05  0.144436  1.283995
2013-01-06  1.589120 -0.178829

Showing label slicing, both endpoints are included

In [139]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.662886  0.579109
2013-01-03 -0.712939 -0.054714
2013-01-04  0.034589 -0.072122

Reduction in the dimensions of the returned object

In [140]:
df.loc['20130102',['A','B']]

A   -0.662886
B    0.579109
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [141]:
df.loc[dates[0],'A']

0.39671681281585658

## Selection by Position

Select via the position of the passed integers

In [142]:
df.iloc[3]

A    0.034589
B   -0.072122
C   -1.028810
D   -0.733341
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [143]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.034589 -0.072122
2013-01-05  0.144436  1.283995

By lists of integer position locations, similar to the numpy/python style

In [144]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.662886  0.140891
2013-01-03 -0.712939  0.433275
2013-01-05  0.144436 -0.141834

For slicing rows explicitly

In [145]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.662886  0.579109  0.140891  1.098659
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728

For slicing columns explicitly

In [146]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.621587  0.015427
2013-01-02  0.579109  0.140891
2013-01-03 -0.054714  0.433275
2013-01-04 -0.072122 -1.028810
2013-01-05  1.283995 -0.141834
2013-01-06 -0.178829 -0.614576

For getting a value explicitly

In [147]:
df.iloc[1,1]

0.57910928815390972

For getting fast access to a scalar (equiv to the prior method)

In [148]:
df.iat[1,1]

0.57910928815390972

# Boolean Indexing

Using a single column’s values to select data.

In [150]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.396717 -0.621587  0.015427  0.782382
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341
2013-01-05  0.144436  1.283995 -0.141834 -1.229215
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341

Selecting values from a DataFrame where a boolean condition is met.

In [151]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.396717       NaN  0.015427  0.782382
2013-01-02       NaN  0.579109  0.140891  1.098659
2013-01-03       NaN       NaN  0.433275       NaN
2013-01-04  0.034589       NaN       NaN       NaN
2013-01-05  0.144436  1.283995       NaN       NaN
2013-01-06  1.589120       NaN       NaN       NaN

Using the ```isin()``` method for filtering:

In [152]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.396717 -0.621587  0.015427  0.782382    one
2013-01-02 -0.662886  0.579109  0.140891  1.098659    one
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728    two
2013-01-04  0.034589 -0.072122 -1.028810 -0.733341  three
2013-01-05  0.144436  1.283995 -0.141834 -1.229215   four
2013-01-06  1.589120 -0.178829 -0.614576 -1.082341  three

In [153]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.712939 -0.054714  0.433275 -0.242728   two
2013-01-05  0.144436  1.283995 -0.141834 -1.229215  four

# Setting

Setting a new column automatically aligns the data by the indexes

In [155]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Setting values by label

In [156]:
df.at[dates[0],'A'] = 0

Setting values by position

In [157]:
df.iat[0,1] = 0

Setting by assigning with a numpy array

In [158]:
df.loc[:,'D'] = np.array([5] * len(df))

In [159]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.015427  5
2013-01-02 -0.662886  0.579109  0.140891  5
2013-01-03 -0.712939 -0.054714  0.433275  5
2013-01-04  0.034589 -0.072122 -1.028810  5
2013-01-05  0.144436  1.283995 -0.141834  5
2013-01-06  1.589120 -0.178829 -0.614576  5

# Operations

## Stats

In [161]:
df.mean()

A    0.065387
B    0.259573
C   -0.199271
D    5.000000
dtype: float64

Same operation on the other axis

In [162]:
df.mean(1)

2013-01-01    1.253857
2013-01-02    1.264279
2013-01-03    1.166406
2013-01-04    0.983414
2013-01-05    1.571649
2013-01-06    1.448929
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [163]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [165]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.712939 -1.054714 -0.566725  4.0
2013-01-04 -2.965411 -3.072122 -4.028810  2.0
2013-01-05 -4.855564 -3.716005 -5.141834  0.0
2013-01-06       NaN       NaN       NaN  NaN

# Apply

In [166]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.015427   5
2013-01-02 -0.662886  0.579109  0.156318  10
2013-01-03 -1.375825  0.524396  0.589594  15
2013-01-04 -1.341236  0.452274 -0.439217  20
2013-01-05 -1.196800  1.736269 -0.581051  25
2013-01-06  0.392320  1.557440 -1.195627  30

In [167]:
df.apply(lambda x: x.max() - x.min())

A    2.302058
B    1.462824
C    1.462086
D    0.000000
dtype: float64

# Histogramming

In [168]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    0
2    5
3    4
4    1
5    1
6    0
7    5
8    0
9    0
dtype: int32

In [169]:
s.value_counts()

0    4
5    2
1    2
4    1
2    1
dtype: int64

# String Methods

In [170]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## Concat

Concatenating pandas objects together with ```concat()```:

In [171]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.339497  0.587924  0.504798 -1.140765
1 -0.596919 -0.306214 -0.388519 -1.453674
2  2.212319 -1.365523  0.661695 -0.418592
3 -1.315521  0.649311  2.946371  0.548906
4  1.544323 -0.038790 -0.748134  1.809524
5 -0.118818  0.003723 -1.375525  0.896687
6  0.016942  0.795173  0.250180  0.759164
7  0.090215  0.243606  0.287638  0.133641
8 -0.039588 -0.720057  0.634778  0.196598
9  0.649470  1.420766  0.662784  1.307738

In [174]:
pieces = [df[:3], df[3:7], df[7:]]
pieces[0]

          0         1         2         3
0  0.339497  0.587924  0.504798 -1.140765
1 -0.596919 -0.306214 -0.388519 -1.453674
2  2.212319 -1.365523  0.661695 -0.418592

In [175]:
pd.concat(pieces)

          0         1         2         3
0  0.339497  0.587924  0.504798 -1.140765
1 -0.596919 -0.306214 -0.388519 -1.453674
2  2.212319 -1.365523  0.661695 -0.418592
3 -1.315521  0.649311  2.946371  0.548906
4  1.544323 -0.038790 -0.748134  1.809524
5 -0.118818  0.003723 -1.375525  0.896687
6  0.016942  0.795173  0.250180  0.759164
7  0.090215  0.243606  0.287638  0.133641
8 -0.039588 -0.720057  0.634778  0.196598
9  0.649470  1.420766  0.662784  1.307738

# Append

In [176]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -2.788491  0.400242 -0.426655 -1.319390
1  1.175855  0.689994 -0.008297  0.192877
2 -0.779314  0.035576  0.324438  0.285073
3 -1.054226  1.587693  0.773837  0.529296
4 -0.683466  0.156172 -1.000627 -1.345123
5  1.324953 -1.311399 -1.353735  0.115264
6  0.570562 -0.142832  0.094831  0.295025
7 -0.743883  0.834450  2.151642  1.113046

In [177]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0 -2.788491  0.400242 -0.426655 -1.319390
1  1.175855  0.689994 -0.008297  0.192877
2 -0.779314  0.035576  0.324438  0.285073
3 -1.054226  1.587693  0.773837  0.529296
4 -0.683466  0.156172 -1.000627 -1.345123
5  1.324953 -1.311399 -1.353735  0.115264
6  0.570562 -0.142832  0.094831  0.295025
7 -0.743883  0.834450  2.151642  1.113046
8 -1.054226  1.587693  0.773837  0.529296

# Grouping

By “group by” we are referring to a process involving one or more of the following steps

+ Splitting the data into groups based on some criteria
+ Applying a function to each group independently
+ Combining the results into a data structure

In [179]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.463433  1.034696
1  bar    one  1.055150 -0.005757
2  foo    two  0.287593 -0.092019
3  bar  three  0.021715  0.043438
4  foo    two -0.434303 -0.196786
5  bar    two  1.047992 -0.171141
6  foo    one -0.091051  0.332254
7  foo  three  0.940632  1.115727

Grouping and then applying a function ```sum``` to the resulting groups.

In [180]:
df.groupby('A').sum()

            C         D
A
bar  2.124856 -0.133459
foo  1.166304  2.193872

In [181]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.055150 -0.005757
    three  0.021715  0.043438
    two    1.047992 -0.171141
foo one    0.372382  1.366950
    three  0.940632  1.115727
    two   -0.146710 -0.288805

# Import/Export Data

## CSV

Writing to a csv

In [183]:
df.to_csv('foo.csv')

Reading from a csv

In [184]:
pd.read_csv('foo.csv')

   Unnamed: 0    A      B         C         D
0           0  foo    one  0.463433  1.034696
1           1  bar    one  1.055150 -0.005757
2           2  foo    two  0.287593 -0.092019
3           3  bar  three  0.021715  0.043438
4           4  foo    two -0.434303 -0.196786
5           5  bar    two  1.047992 -0.171141
6           6  foo    one -0.091051  0.332254
7           7  foo  three  0.940632  1.115727